#include <stdio.h>

int countNumbers(int r) {                                                              // Функція для підрахунку кількості чисел із р розрядів
    int count = 0;                                                                     // Ініціалізуємо лічильник кількості чисел

    if (r <= 0 || r > 30) {
        printf("Невірне значення розряду (р). Розряд повинен бути від 1 до 30.\n");
        return count;                                                                  // Повертаємо 0, якщо р не входить в діапазон від 1 до 30
    }

    for (int i = 0; i < r; i++) {

        if (i > 0 && ((i - 1) % 2 == 0) && (((i - 1) / 2) % 2 == 0)) {                 // Формула для обчилення кількості чисел
            continue;
        }

        count++;                                                                       // Збільшуємо лічильник кількості чисел
    }

    return count;                                                                     // Повертаємо результат
}

int main() {
    int r;
    printf("Введіть кількість розрядів р(від 1 до 30): \n");
    scanf_s("%d", &r);                                                                 // Зчитуємо вхідні дані

    int result = countNumbers(r);                                                    // Викликаємо функцію для підрахунку кількості чисел

    printf("Кількість чисел із %d розрядів: %d\n", r, result);                       // Виводимо результат

    return 0;
}