#include <stdio.h>
int Locsi(int x, int y) { // 2-22 строки - ‘ункц≥€ дл€ обчисленн€ м≥н≥мального кроку
    if (x == y) {
        return 0;      // ¬ипадок коли х р≥ний у, тому кроки непотр≥бн≥
    }
    int steps = 0;
    int diff = y - x;

    if (diff > 0) {       // €кщо р≥зниц€ б≥льша за 0
        if (diff % 2 == 0) {
            steps = 2;    // якщо р≥зниц€ Ї парним числом, то можна зробити 2 кроки
        }
        else {
            steps = 3;    // якщо р≥зниц€ Ї непарним числом, то можна зробити 3 кроки
        }
    }
    else {
        steps = 1;     // якщо р≥зниц€ менша за 0, то потр≥бно зробити 1 крок
    }

    return steps;
}
int main() {
    int x, y;
    printf("¬вед≥ть значенн€ x: "); // ¬веденн€ х
    scanf_s("%d", &x);
    printf("¬вед≥ть значенн€ y: "); // ¬веденн€ у
    scanf_s("%d", &y);

    int answer = Locsi(x, y);   // ¬иклик функц≥њ п≥сл€ введенн€ х та у
    printf("ћ≥н≥мальна к≥льк≥сть крок≥в: %d\n", answer); // ¬иведенн€ м≥н≥мальноњ к≥лькост≥ крок≥в

    return 0;
}