#include <stdio.h>
#include <stdlib.h>
int main() {
    int t1, t2, t3;
    double total_time; // Обрав double, бо займає менше місця і надає більшу точність //
    printf("Введіть три значення(час за який 3 людини зїдають періг окремо!)\n");

    scanf_s("%d %d %d", &t1, &t2, &t3); // Зчитування вхідних даних //

    total_time = (double)(1 / (1.0 / t1 + 1.0 / t2 + 1.0 / t3)); // Обчислення загального часу //

    printf("Час, за який 3 людини зїдять періг разом\n");
    printf("%.2f\n", total_time); // Виведення результату //

    return 0;
}
